In [1]:
import pandas as pd
print(pd.__version__)

1.3.4

In [2]:
df = pd.DataFrame({'marks_out_of_25': [10, 23, 14, 25]},
                  index=['Sarah', 'Shreyansh', 'Atul', 'Roshan'])
df

           marks_out_of_25
Sarah                   10
Shreyansh               23
Atul                    14
Roshan                  25

In [3]:
df.assign(percentage=lambda x: x.marks_out_of_25 * 4)

           marks_out_of_25  percentage
Sarah                   10          40
Shreyansh               23          92
Atul                    14          56
Roshan                  25         100

In [4]:
arr = {'X': [215,325,185,332,406,522,412,614,544,421,445,408], 'Y': [14.2,16.4,11.9,15.2,18.5,22.1,19.4,25.1,23.4,18.1,22.6,17.2]}
df = pd.DataFrame(data=arr)
df.columns = [  'Lemonade_Sales',  'Temperature_°C']
df

    Lemonade_Sales  Temperature_°C
0              215            14.2
1              325            16.4
2              185            11.9
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [5]:
df[df['Lemonade_Sales']> 250]

    Lemonade_Sales  Temperature_°C
1              325            16.4
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [6]:
df[df['Temperature_°C']>23][['Temperature_°C', 'Lemonade_Sales']]

   Temperature_°C  Lemonade_Sales
7            25.1             614
8            23.4             544

In [7]:
df = pd.DataFrame(data=arr)
df.columns = [  'Lemonade_Sales',  'Temperature_°C']
df

    Lemonade_Sales  Temperature_°C
0              215            14.2
1              325            16.4
2              185            11.9
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [8]:
df[(df['Temperature_°C']>18)  |  (df['Lemonade_Sales']<300)]

    Lemonade_Sales  Temperature_°C
0              215            14.2
2              185            11.9
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6

In [9]:
import numpy as np

In [10]:
arr = {'A':[1,2,np.nan],'B':[5, np.nan, np.nan],'C':[1,2,3]}

In [11]:
df = pd.DataFrame(arr)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [14]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [15]:
first = ['F1', 'F1', 'F1', 'F2', 'F2', 'F2']
second = [1,2,3,1,2,3]
top_index = list(zip(first, second))
top_index = pd.MultiIndex.from_tuples(top_index)

In [16]:
df = pd.DataFrame(np.random.randn(6,2), top_index, ['A', 'B'])
df

             A         B
F1 1 -0.242874 -0.942123
   2 -1.131421  0.751277
   3  0.810794  0.793413
F2 1 -0.538703  1.016668
   2  0.546939  1.235266
   3  0.883745 -2.384056

In [17]:
df.loc['F1']

          A         B
1 -0.242874 -0.942123
2 -1.131421  0.751277
3  0.810794  0.793413

In [18]:
df.loc['F2']

          A         B
1 -0.538703  1.016668
2  0.546939  1.235266
3  0.883745 -2.384056

In [19]:
df.loc['F2'].loc[1]

A   -0.538703
B    1.016668
Name: 1, dtype: float64

In [20]:
df.loc['F1'].loc[1][0]

-0.2428739471323308

In [21]:
df.index.names

FrozenList([None, None])

In [22]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
F1     1   -0.242874 -0.942123
       2   -1.131421  0.751277
       3    0.810794  0.793413
F2     1   -0.538703  1.016668
       2    0.546939  1.235266
       3    0.883745 -2.384056

In [23]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
F1     1   -0.242874 -0.942123
       2   -1.131421  0.751277
       3    0.810794  0.793413
F2     1   -0.538703  1.016668
       2    0.546939  1.235266
       3    0.883745 -2.384056

In [1]:
import numpy as np
import pandas as pd
dict_a = {
   "name": ["John", "Jane", "Emily"],
   "height": [178, 175, 177],
   "age": [25, 22, 27]
}
df = pd.DataFrame(dict_a)
df

    name  height  age
0   John     178   25
1   Jane     175   22
2  Emily     177   27

In [2]:
dict_b = {
   "date": pd.date_range("2020-01-01", periods=5, freq="D"),
   "store": "A",
   "sales": np.random.randint(50, 100, size=5)
}
df = pd.DataFrame(dict_b)
df

        date store  sales
0 2020-01-01     A     74
1 2020-01-02     A     57
2 2020-01-03     A     99
3 2020-01-04     A     77
4 2020-01-05     A     85

In [3]:
df = pd.DataFrame({'marks_out_of_25': [10, 23, 14, 25]},
                  index=['Sarah', 'Shreyansh', 'Atul', 'Roshan'])
df

           marks_out_of_25
Sarah                   10
Shreyansh               23
Atul                    14
Roshan                  25

In [4]:
df.assign(percentage=lambda x: x.marks_out_of_25 * 4)

           marks_out_of_25  percentage
Sarah                   10          40
Shreyansh               23          92
Atul                    14          56
Roshan                  25         100

In [5]:
arr = {'X': [215,325,185,332,406,522,412,614,544,421,445,408], 'Y': [14.2,16.4,11.9,15.2,18.5,22.1,19.4,25.1,23.4,18.1,22.6,17.2]}
df = pd.DataFrame(data=arr)
df.columns = [  'Lemonade_Sales',  'Temperature_°C']
df

    Lemonade_Sales  Temperature_°C
0              215            14.2
1              325            16.4
2              185            11.9
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [6]:
df[df['Lemonade_Sales']> 250]

    Lemonade_Sales  Temperature_°C
1              325            16.4
3              332            15.2
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6
11             408            17.2

In [7]:
df[df['Temperature_°C']>23][['Temperature_°C', 'Lemonade_Sales']]

   Temperature_°C  Lemonade_Sales
7            25.1             614
8            23.4             544

In [8]:
df[df['Temperature_°C']<22][[ 'Lemonade_Sales']]

    Lemonade_Sales
0              215
1              325
2              185
3              332
4              406
6              412
9              421
11             408

In [9]:
df[(df['Temperature_°C']>18)  |  (df['Lemonade_Sales']<300)]

    Lemonade_Sales  Temperature_°C
0              215            14.2
2              185            11.9
4              406            18.5
5              522            22.1
6              412            19.4
7              614            25.1
8              544            23.4
9              421            18.1
10             445            22.6

In [10]:
arr = {'A':[1,2,np.nan],'B':[5, np.nan, np.nan],'C':[1,2,3]}

In [11]:
df = pd.DataFrame(arr)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [12]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [13]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [14]:
df.fillna(value=df['A'].mean())

     A    B  C
0  1.0  5.0  1
1  2.0  1.5  2
2  1.5  1.5  3

In [15]:
first = ['F1', 'F1', 'F1', 'F2', 'F2', 'F2']
second = [1,2,3,1,2,3]
top_index = list(zip(first, second))
top_index = pd.MultiIndex.from_tuples(top_index)

In [16]:
df = pd.DataFrame(np.random.randn(6,2), top_index, ['A', 'B'])
df

             A         B
F1 1 -1.315944 -0.572680
   2  0.262038 -0.851992
   3  1.687310 -0.246764
F2 1 -0.126192  0.140136
   2  0.549604  0.024503
   3  1.222672  0.011625

In [17]:
df.loc['F1']

          A         B
1 -1.315944 -0.572680
2  0.262038 -0.851992
3  1.687310 -0.246764

In [18]:
df.loc['F2'].loc[1]

A   -0.126192
B    0.140136
Name: 1, dtype: float64

In [19]:
df.loc['F1'].loc[1][0]

-1.3159437112398016

In [20]:
df.index.names

FrozenList([None, None])

In [21]:
df.index.names = ['Groups', 'Num']
df

                   A         B
Groups Num
F1     1   -1.315944 -0.572680
       2    0.262038 -0.851992
       3    1.687310 -0.246764
F2     1   -0.126192  0.140136
       2    0.549604  0.024503
       3    1.222672  0.011625

In [22]:
df.xs(1, level='Num')

               A         B
Groups
F1     -1.315944 -0.572680
F2     -0.126192  0.140136

In [ ]:
#Multi-chaining in Pandas
df = pd.read_csv('data.csv')
df = df.fillna(...)
df = df.query('some_condition')
df['new_column'] = df.cut(...)
df = df.pivot_table(...)
df = df.rename(...)
df = (pd.read_csv('data.csv')
   .fillna(...)
   .query('some_condition')
   .assign(new_column = df.cut(...))
   .pivot_table(...)
   .rename(...)
)

In [ ]:
# Using at()
df.at[4, 'column_name'] = 'new_value'

# Using iat()
df.iat[4, 3] = 'new_value'

In [ ]:
bins = [0, 18, 25, 35, 60, 100]
names = ['<18', '18-24', '25-34', '35-59', '60+']

df['AgeRange'] = pd.cut(df['Age'], bins, labels=names)

In [ ]:
condition = np.array([True, False, True])
x = np.array([1, 2, 3])
y = np.array([4, 5, 6])

np.where(condition, x, y)  # Returns array([1, 5, 3])

In [ ]:
df.groupby(pd.Grouper(key='date_column', freq='M')).sum()

In [ ]:
dummies = pd.get_dummies(df['categorical_column'])

In [ ]:
df.query('column_name > 20')

In [ ]:
conditions = [
    (df['column1'] > 20) & (df['column2'] > 30),
    (df['column1'] < 10)
]



# create a list of the values we want to assign for each condition
values = ['value1', 'value2']
# create a new column and use np.select() to assign values to it using our lists as arguments
df['new_column'] = np.select(conditions, values)

In [ ]:
display_settings = {
    'max_columns': 10,
    'expand_frame_repr': True,  # Wrap to multiple pages
    'max_rows': 10,
    'precision': 2,
    'show_dimensions': True
}

for op, value in display_settings.items():
    pd.set_option("display.{}".format(op), value)

In [ ]:
pd.concat([october_df, november_df, december_df], axis=0)

In [ ]:
pd.concat([features_1to5_df, features_6to10_df, features_11to15_df], axis=1)

In [ ]:
pd.merge(left=ids_and_time_df,
         right=ids_and_videos_df,
         on="id")

In [ ]:
players_data = {'Player': ['Superman', 'Batman', 'Thanos', 'Batman', 'Thanos',
   'Superman', 'Batman', 'Thanos', 'Black Widow', 'Batman', 'Thanos', 'Superman'],
   'Year': [2000,2000,2000,2001,2001,2002,2002,2002,2003,2004,2004,2005],
   'Points':[23,43,45,65,76,34,23,78,89,76,92,87]}
   
df = pd.DataFrame(players_data)

print(df)

In [ ]:
players_data = {'Player': ['Superman', 'Batman', 'Thanos', 'Batman', 'Thanos',
   'Superman', 'Batman', 'Thanos', 'Black Widow', 'Batman', 'Thanos', 'Superman'],
   'Year': [2000,2000,2000,2001,2001,2002,2002,2002,2003,2004,2004,2005],
   'Points':[23,43,45,65,76,34,23,78,89,76,92,87]}
   
df = pd.DataFrame(players_data)

print(df)

In [ ]:
groups_df = df.groupby('Player')

for player, group in groups_df:
   print("----- {} -----".format(player))
   print(group)
   print("")

In [ ]:
df = df.stack()